package com.example.backend.student.controller;

public class TodoList {


// 한거
//   과목별 조회 멍청이같이 기수 단위로 조회 안하고 기반기술 하면 모든 기수 기반 기술 다 나옴 ㅋㅋㅋ
    // 했으니까 프론트 연결  ㅇㅇ
    // 학생에서 기수 정보 받아야함 manytoOne 관계  학생 디테일 - > 커리큘럼 idx 받아와야함
    //
    // 부트캠프 신청도 필요함 학생 기수 넣으려면 해당 부트캠프에 지원을 해야하기 때문입니다 . 신청은 만듬(프론트 만들어서 부족한거 매워야함)
    // 커리큘럼 신청하면




//Todo
//    해야할 것
//    백엔드
    // 휴가 데이터 들어가는데 이제 휴가 있는거에서 - 1 해줘야함
    // 출석 하루에 1번이고 퇴실 찍힐때 출석 올라가야함

//  커리큘럼 신청 있어야함 get 으로 신청하게 해놨는데 건하님이랑 이야기 해봐야함


//Todo
// 프론트
// 출,퇴 연결해놨는데 출석 누르고 도망가는애들 생김 퇴실 찍힐때 출석 일수 올라가가게 해야함

    // 로그는 만들었음
// 휴가 조퇴 처음부터 다시 만들어야함 시간 등록이 없음 그리고 종합적으로 출,퇴,휴,조 때렸을때 Log 필요해서 만들어야함


}
